Repository: FreePBX-ContributedModules/dynroute
Catalog: i18n/*/LC_MESSAGES/dynroute.po
Languages: it_it, nl_nl

source: A connection to Asterisk Manager could not be made. This module requires Asterisk to be running and have proper credentials
it_it: Non è possibile connettere a Asterisk Manager. Asterisk deve essere attivo e le credenziali di accesso valide

source: AGI Lookup
it_it: Nome script AGI

source: AGI Result Variable
it_it: AGI Nome del variabile che contiene il risultato

source: AGI to use to obtain the result (it must return text only, no html, xml or json. For example test.agi,param1,param2 The following substitutions are available for use in the input parameters:<br>[NUMBER] the callerid number<br>[INPUT] the dtmf sequence input<br>[DID] the dialed number<br>[xxx] where xxx is the name of an input or result variable saved from a previous dynamic route on the same call
it_it: Nome script AGI da eseguire per ottenere il risultato (solo testo, no html, xml o json). Ad esempio test.agi,param1,param2. Si possono utilizzare queste sostituzioni<br>[NUMBER] callerid<br>[INPUT] dtmf<br>[DID] numero chiamato<br>[xxx] dove xxx è il nome di un variabile di input o di risultato salvato da un precedente dynamic route utilizzato sulla stessa chiamata

source: Actions
it_it: Azioni

source: Add Dynamic Route
it_it: Aggiungi Dynamic Route

source: Announcement
it_it: Registrazione
nl_nl: Aankondiging bericht

source: Asterisk Variable
it_it: Variabile Asterisk

source: Asterisk variable whose value is to be used. The following substitutions are available:<br>[NUMBER] the callerid number<br>[INPUT] the dtmf sequence input<br>[DID] the dialed number<br>[xxx] where xxx is the name of an input or result variable saved from a previous dynamic route on the same call
it_it: Nome del variable o espressione Asterisk da utilizzare per ottenere il risultato. Si possono utilizzare queste sostituzioni<br>[NUMBER] callerid<br>[INPUT] dtmf<br>[DID] numero chiamato<br>[xxx] dove xxx è il nome di un variabile di input o di risultato salvato da un precedente dynamic route utilizzato sulla stessa chiamata

source: Connection Error
it_it: Errore di connessione

source: Database to use.
it_it: Database da utilizzare.

source: Default Destination
it_it: Destinazione di default

source: Delete
it_it: Elimina
nl_nl: Verwijder

source: Delete this entry. Dont forget to click Submit to save changes!
it_it: Cancella. Ricorda di salvare la modifica!

source: Description
it_it: Descrizione

source: Description of this Dynamic Route
it_it: Descrizione del Dynamic Route

source: Destination
it_it: Destinazione
nl_nl: Bestemming

source: Destination to send the call to if the dtmf did not match the validation rule and maximum retries has been reached
it_it: Destinazione quando il DTMF è invalido rispetto alla regola di validazione ed è stato raggiunto il numero massimo di tentativi

source: Destination to send the call to if there is no match in the Dynamic Route Entries section below or if the lookup fails or returns an empty value.
it_it: Destinazione nel caso non ci sia una corespondenza con i valori nella sezione sottostante oppure se il lookup fallisce o ritorna un valore vuoto.

source: Duplicate
it_it: Duplica

source: Dyname Route Name
it_it: Nome del Dynamic Route

source: Dynamic Route DTMF Options
it_it: Dynamic Route Opzioni DTMF

source: Dynamic Route Default Entry
it_it: Dynamic Route Destination di Default

source: Dynamic Route Description
it_it: Descrizione

source: Dynamic Route Entries
it_it: Dynamic Route Destinazioni

source: Dynamic Route General Options
it_it: Dynamic Route Opzioni Generali

source: Dynamic Route List
it_it: Elenco Dynamic Routes

source: Dynamic Route Lookup Source
it_it: Dynamic Route Sorgente

source: Dynamic Route Name
it_it: Nome del Dynamic Route

source: Dynamic Route Saved Variables
it_it: Dynamic Route Variabli

source: Edit Dynamic Route:
it_it: Modifica Dynamc Route:

source: Edit:
it_it: Modifica:

source: Enable DTMF Input
it_it: Abilita DTMF

source: Enable substitutions
it_it: Abilita sostituzioni

source: Enable variable substitutions in the lookup query (for [INPUT], [NUMBER], [DID] or [name] where name is a Saved Input Variable Name or Saved Result Variable Name from a previous Dynamic Route). You probably want to disable this if using a lookup type of Asterisk Variable and a REGEX expression in the lookup since substitions can be interpreted wrongly.
it_it: Abilita sostituzioni nel query (per [INPUT], [NUMBER], [DID] o [nome] dove npme è il Variable per salvare input o Variable per salvare risultato da un precedente Dynamic Route). Probabilmente conviene disabilitare le sostituzioni quando si usa un lookup del tipo Asterisk Variable che contiene un'espressione REGEX poiché sostituzione potrebbe essere malinterpretato in questo caso.

source: Greeting to be played prior to DTMF input.
it_it: Registrazione da riprodurre prima del DTMF.

source: Hostname of MySQL server
it_it: Nome host del server MySQl

source: Invalid Destination
it_it: Destinazione invalida

source: Invalid Recording
it_it: Registrazione per invalido

source: Invalid Retries
it_it: Tentativi

source: Invalid Retry Recording
it_it: Registrazione per ripetere su invalido

source: List Dynamc Routes
it_it: Elenco Dynamic Routes

source: Match
it_it: Valore
nl_nl: Geëvenaard resultaat

source: Max digits
it_it: Numero massimo di cifre DTMF

source: Maximum number of DTMF digits. If zero then no limit. Avoids having to press # key at end of fixed input length. Additional DTMF input is ignored.
it_it: Numero massimo di cifre DTMF. Se zero nessuno limite. Evita di dover premere # alla fine di un input di lunghezza predefinita. Cifre oltre il limite sono ignorati.

source: Name of result variable used in AGI script.
it_it: Nome del variabile di ritorno dello script AGI.

source: Name of this Dynamic Route
it_it: Nome di questo Dynamic Route

source: Name of variable in which to save dtmf input for future use in the dialplan or further dynamic routes. This is available as [xxx] in the query/lookup where xxx is the name of the variable you specify here. To use the variable in the dialplan (e.g. custom applicaitons) it is necessary to prefix it with DYNROUTE_ e.g. DYNROUTE_xxx
it_it: Variabile per salvare DTMF per uso futuro nel dialplan o in ulteriori Dynamic Routes. Questo valore è disponibile come [xxx] nella query/lookup dove xxx è il nome del variable specificato in questo campo. Per utilizzare il variable nel dialplan (esempio custom applications) è necessario prefissare con DYNROUTE_, esempio DYNROUTE_xxx

source: Name of variable in which to save lookup result for future use in the dialplan or further dynamic routes. This is available as [xxx] in the query/lookup where xxx is the name of the variable you specify here. To use the variable in the dialplan (e.g. custom applicaitons) it is necessary to prefix it with DYNROUTE_ e.g. DYNROUTE_xxx. In the case of lookup type None then this will be valorized with DTMF input (if enabled).
it_it: Variabile per salvare il risultato del lookup per uso futuro nel dialplan o in ulteriori Dynamic Routes. Questo valore è disponibile come [xxx] nella query/lookup dove xxx è il nome del variable specificato in questo campo. Per utilizzare il variable nel dialplan (esempio custom applications) è necessario prefissare con DYNROUTE_, esempio DYNROUTE_xxx.

source: No Astman, Not loading Dynroute
it_it: Astman non disponibile, Dynroute non caricato

source: None
it_it: Nessuno

source: Number of times to retry when DTMF does not match validation rule.
it_it: Numero di volte di riprovare se DTMF fallisce la validazione.

source: ODBC Function to use. The value used here should be the name of a section in /etc/asterisk/func_odbc.conf without the ODBC_ prefix that asterisk adds. The dynroute module will add the ODBC_ prefix. For debugging you can also check if the ODBC function is registered at the asterisk console with "core show functions ".
it_it: Funzione ODBC da utilizzare. Dovrebbe essere il nome di una sezione nel file /etc/asterisk/func_odbc.conf senza il prefisso ODBC_ che Asterisk aggiunge. Dynamic Route aggiungerà il prefisso. Puoi anche verificare se la funzione è registrata dal console di Asterisk con il commando "core show functions ".

source: Password to use for connection to MySQL server
it_it: Password MySQL

source: Prompt to be played if dtmf does not match validation rules and maximum retries has not been reached
it_it: Registrazione per ripetere su invalido

source: Prompt to be played when a timeout occurs, before prompting the caller to try again
it_it: Registrazione su invalido quando sono esausti i tentativi previsti o non era previsto un nuovo tenativo

source: Query to use to obtain the result from the MySQL database. The following substitutions are available:<br>[NUMBER] the callerid number<br>[INPUT] the dtmf sequence input<br>[DID] the dialed number<br>[xxx] where xxx is the name of an input or result variable saved from a previous dynamic route on the same call
it_it: Query da eseguire per ottenere le info dal database MySQL. Si possono utilizzare queste sostituzioni<br>[NUMBER] callerid<br>[INPUT] dtmf<br>[DID] numero chiamato<br>[xxx] dove xxx è il nome di un variabile di input o di risultato salvato da un precedente dynamic route utilizzato sulla stessa chiamata

source: Query to use to obtain the result from the database. The following substitutions are available:<br>[NUMBER] the callerid number<br>[INPUT] the dtmf sequence input<br>[DID] the dialed number<br>[xxx] where xxx is the name of an input or result variable saved from a previous dynamic route on the same call
it_it: Query da eseguire per ottenere le info dal database. Si possono utilizzare queste sostituzioni<br>[NUMBER] callerid<br>[INPUT] dtmf<br>[DID] numero chiamato<br>[xxx] dove xxx è il nome di un variabile di input o di risultato salvato da un precedente dynamic route utilizzato sulla stessa chiamata

source: Reset
it_it: Reimposta

source: Saved input variable name
it_it: Variabile per salvare input

source: Saved result variable name
it_it: Variabile per salvare risultato

source: Source Type
it_it: Tipo sorgente

source: Submit
it_it: Invio

source: The source of the information to be looked up.
it_it: Sorgente delle info.

source: Time in seconds to wait for DTMF input
it_it: Tempo in secondi per attendere DTMF

source: URL to use to obtain the result (it must return text only, no html, xml or json. Exmaple http://localhost/test.php?param1=4&param2=9 The following substitutions are available:<br>[NUMBER] the callerid number<br>[INPUT] the dtmf sequence input<br>[DID] the dialed number<br>[xxx] where xxx is the name of an input or result variable saved from a previous dynamic route on the same call
it_it: URL da usare per ottenere il risultato (deve ritornare solo testo, no html, xml o json). Esempio http://localhost/test.php?param1=4&param2=9. Si possono utilizzare queste sostituzioni<br>[NUMBER] callerid<br>[INPUT] dtmf<br>[DID] numero chiamato<br>[xxx] dove xxx è il nome di un variabile di input o di risultato salvato da un precedente dynamic route utilizzato sulla stessa chiamata

source: Username to use for connection to MySQL server
it_it: Utente MySQL

source: Validation
it_it: Validazione

source: Validation rules using a Asterisk regular expression. The DTMF input will be validated with Asterisk REGEX_MATCH function using this REGEX. For example to ensure the input is between 3 and 4 digits long you could use ^[0-9]\{3,4\}$ in this field. Non matching DTMF will produce a retry depending on the value of Invalid Retries.
it_it: Regola di valudzione utilizzando un REGEX di Asterisk. Il DTMF sarà validato con la funzione Asterisk REGEX_MATCH utilizzando questo REGEX. Esempio: per verificare che il DTMF e fra 3 e 4 cifre, si puà utilizzare ^[0-9]\{3,4\}$ in questo campo. In caso di DTMF che non supera la validazione, ci sarà la possibilità di un altro tentativo a secondo il valore "Tenativi".

source: Wait for DTMF input
it_it: Attende DTMF

source: Yes
it_it: Si

source: value to be matched
it_it: valore da confrontare

source: Dynamic route: %s
nl_nl: Dynamische route: %s

source: Route: %s / Destination: %s
nl_nl: Route: %s / Bestemming: %s

source: Instructions
nl_nl: Instructies

source: You use the Dynamic Routing module to route calls based on sql lookup.
nl_nl: U kunt de Dynamische Route module gebruiken om gespreken door te sturen op basis van een SQL lookup in een (externe) database.<br />

source: Add Route
nl_nl: Voeg een route toe

source: Edit Menu
nl_nl: Bewerk Route

source: Change Name
nl_nl: Pas de naam van de route aan

source: This changes the short name, visible on the right, of this Route
nl_nl: Hiermee past u de naam aan van de route, welke zichtbaar is in het lijstje van routes aan de rechterzijde

source: Get DTMF input
nl_nl: Luister naar DTMF tonen (de ingedrukte toetsen)

source: If checked reads in DTMF digis, the value is available in the sql query with special name of [INPUT].
nl_nl: indien aangevinkt luistert de module naar DTMF tonen, en zal het ingetoetste cijfer(s) beschikbaar zijn voor de MySQL query met de tag [INPUT]

source: The amount of time (in seconds) to wait for input
nl_nl: Het aantal seconde zolang er gewacht wordt voor het intoetsen van de toetsen (DTMF tonen).

source: Input Variable
nl_nl: Input variabele

source: Optional variable name if you want the dmtf input to be available later in the call (e.g. futher dynamic route query or to pass to agi script)
nl_nl: optionele variabele naam voor het gebruik van de DTMF input op een later moment. (bv. extra dynamische routes of een agi script)

source: Result Variable
nl_nl: Resultaat Variabele

source: Optional variable name if you want the query result to be available later in the call (e.g. futher dynamic route query or to pass to agi script)
nl_nl: Optionele Variabele naam, indien het resultaat in een later stadium weer gebruikt dient te worden.(bv. extra dynamische routes of een agi script)

source: Source type
nl_nl: lookup soort

source: Select the source type, you can choose between:<ul><li>MySQL: It queries a MySQL database to retrieve the routing information</li><li>ODBC: It queries an ODBC data source to retrieve the routing information</li></ul>
nl_nl: Selecteer het lookup soort, kunt u kiezen tussen: <ul> <li> MySQL: Het vraagt ​​een MySQL database om de routing informatie op te halen </ li> <li> ODBC: Het vraagt ​​een ODBC-gegevensbron aan de route-informatie </ ophalen li> </ ul>

source: Function
nl_nl: Functie

source: Name of the odbc function (excluding ODBC prefix) in /etc/asterisk/func_odbc.conf
nl_nl: Naam van de ODBC-functie (zonder ODBC prefix) in / etc / asterisk / func_odbc.conf

source: Hostname or IP address of the server running the MySQL database
nl_nl: De server naam of het IP adres van de server waar de MySQL database van benaderd dient te worden.

source: The name of the database out of wich the information is being queried
nl_nl: De naam van de database, welke je wilt gebruiken voor het opvragen van informatie

source: Username
nl_nl: Loginnaam

source: The user/login name for accessing the database
nl_nl: De gebruikers/login naam welke gebruikt dient te worden om toegang te krijgen tot de database

source: Password
nl_nl: Wachtwoord

source: The password wich is needed to access the database
nl_nl: Het wachtwoord voor de gebruikers/login naam

source: The query wich gets the result out of the database
nl_nl: De query (select) waarmee gegevens opgevraagd gaan worden uit de database

source: Increase Destinations
nl_nl: Meer bestemmingen

source: Save
nl_nl: Opslaan

source: Decrease Destinations
nl_nl: Minder bestemmingen

source: Default destination
nl_nl: Default bestemming

source: Invalid destination
nl_nl: Ongeldige bestemming

source: Leave blank to remove
nl_nl: Laat leeg om te verwijderen
